/// 八字参考资料数据
library;

const tianGanTable = [
  {'天干': '甲', '五行': '木', '阴阳': '阳'},
  {'天干': '乙', '五行': '木', '阴阳': '阴'},
  {'天干': '丙', '五行': '火', '阴阳': '阳'},
  {'天干': '丁', '五行': '火', '阴阳': '阴'},
  {'天干': '戊', '五行': '土', '阴阳': '阳'},
  {'天干': '己', '五行': '土', '阴阳': '阴'},
  {'天干': '庚', '五行': '金', '阴阳': '阳'},
  {'天干': '辛', '五行': '金', '阴阳': '阴'},
  {'天干': '壬', '五行': '水', '阴阳': '阳'},
  {'天干': '癸', '五行': '水', '阴阳': '阴'},
];

const diZhiTable = [
  {'地支': '子', '生肖': '鼠', '五行': '水', '月份': '11-12月'},
  {'地支': '丑', '生肖': '牛', '五行': '土', '月份': '1-2月'},
  {'地支': '寅', '生肖': '虎', '五行': '木', '月份': '2-3月'},
  {'地支': '卯', '生肖': '兔', '五行': '木', '月份': '3-4月'},
  {'地支': '辰', '生肖': '龙', '五行': '土', '月份': '4-5月'},
  {'地支': '巳', '生肖': '蛇', '五行': '火', '月份': '5-6月'},
  {'地支': '午', '生肖': '马', '五行': '火', '月份': '6-7月'},
  {'地支': '未', '生肖': '羊', '五行': '土', '月份': '7-8月'},
  {'地支': '申', '生肖': '猴', '五行': '金', '月份': '8-9月'},
  {'地支': '酉', '生肖': '鸡', '五行': '金', '月份': '9-10月'},
  {'地支': '戌', '生肖': '狗', '五行': '土', '月份': '10-11月'},
  {'地支': '亥', '生肖': '猪', '五行': '水', '月份': '11-12月'},
];

const cangGanTable = [
  {'地支': '子', '本气': '癸', '中气': '无', '余气': '无'},
  {'地支': '丑', '本气': '己', '中气': '癸', '余气': '辛'},
  {'地支': '寅', '本气': '甲', '中气': '丙', '余气': '戊'},
  {'地支': '卯', '本气': '乙', '中气': '无', '余气': '无'},
  {'地支': '辰', '本气': '戊', '中气': '乙', '余气': '癸'},
  {'地支': '巳', '本气': '丙', '中气': '庚', '余气': '戊'},
  {'地支': '午', '本气': '丁', '中气': '己', '余气': '无'},
  {'地支': '未', '本气': '己', '中气': '丁', '余气': '乙'},
  {'地支': '申', '本气': '庚', '中气': '壬', '余气': '戊'},
  {'地支': '酉', '本气': '辛', '中气': '无', '余气': '无'},
  {'地支': '戌', '本气': '戊', '中气': '辛', '余气': '丁'},
  {'地支': '亥', '本气': '壬', '中气': '甲', '余气': '无'},
];
